{
  "greeting": {
    "response": ["SUPERVISED learning is used to learn how a certain feature depends on other variables and what it does is trying to make predictions on new data.", "On the other hand", "UNSUPERVISED learning is used to understand how the data is distributed in a more general way"],
    "response2": ["If you have already collected some data (address, size, no. rooms, garden, renovation year, energy class) about the house sales in the neighborhood we can help you finding the right price for the house you are trying to sell. That’s a typical SUPERVISED learning task.", "Instead,","If you are a business owner and you’ve got the history of sales, we can help you finding the main types of customers that visit your website. That’s a typical unsupervised learning task.", "Instead, ...","If you are a business owner and you’ve got the history of sales, we can help you finding the main types of customers that visit your website. That’s a typical UNSUPERVISED learning task."],
    "image": "./conversation/conv_blocks/supvsunsup.png"
  },
  "unsupervised": {
    "response": ["CLUSTERING is the process of dividing a given population into a number of groups so that each single group is made up by similar elements", "On the other hand", "ASSOCIATION finds important relations between variables or features in a data set."],
    "response2": ["Many businesses use CLUSTER analysis to identify consumers who are similar to each other so they can tailor their emails sent to consumers in such a way that maximizes their revenue.", "While, ...", "ASSOCIATION rules are used to analyze supermarket shopping carts. Imagine you're planning to make tomato sauce for pizza. You’re probably going to buy tomatoes, onions, garlic, maybe olive oil or fresh basil. And for sure there are many other people buying similar things. We could start to see some things in common. “If somebody buys canned tomatoes, then they are more likely to buy dried pasta“. Armed with this knowledge, a supermarket could print you a coupon at checkout for something you didn’t purchase, hoping that you would come back. "],
    "image": "./conversation/conv_blocks/unsupervised.png"
  },
  "supervised": {
    "response": ["REGRESSION algorithms are used to predict continuous values such as price, salary, age, etc.", "Whereas...","CLASSIFICATION algorithms are used to predict/classify discrete values such as Male or Female, True or False, Spam or Not Spam, etc."],
    "response2": ["The best example to understand the CLASSIFICATION problem is Email Spam Detection. A detection model is trained on the basis of millions of emails on different parameters, and whenever it receives a new email, it identifies whether the email is spam or not. If the email is spam, then it is moved to the Spam folder.", "On the contrary", "Suppose we want to do weather forecasting: for this, we will use the REGRESSION algorithm. In weather prediction, the algorithm is trained on the past data, and once the training is completed, it can easily predict the weather for future days."],
    "image": "./conversation/conv_blocks/supervised.png"
  }
}